Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: འོད་དཔག་ཚད། །ཉི་ཤུ་རྩ་གཅིག་མཆོད་སྦྱིན་བཟང་པོ་ཡབ། །ཡེ་ཤེས་མཆོག་མ་ཞེས་བྱ་རྒྱལ་བའི་ཡུམ། །སྲས་པོ་ཤེས་བྱིན་ཤེས་ལེགས་རིམ་གྲོ་པ། །
en: And his light will extend twenty-one leagues. “Excellent Sacrifice will be his father, and Supreme Wisdom will be this victor’s mother. Knowledge Gift will be his son and Excellent Knowledge his attendant.

source: རིན་ཆེན་འབྱུང་གནས་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: Source of Jewels will be the scholar

source: ཤེས་ལྡན་མཆོད་ཅེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Knowledgeable Worship the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །ཐེག་པ་མཆོག་གིས་སྲིད་རྩེར་ཕྱིན་པ་པོ། །བྱེ་ཕྲག་དྲུག་ཅུ་རྩ་ནི་རེ་རེ་ཡོད། །
en: “There will be eighty consecutive congregations, Each of them gathering six hundred million Who have gone to the summit of existence by means of the supreme vehicle.

source: དྲང་སྲོང་ཕུལ་དུ་ཕྱིན་པའི་དམ་ཆོས་དག །
en: “And the sacred Dharma of this perfect sage

source: ལོ་གྲངས་དྲུག་ཁྲི་སུམ་སྟོང་བར་དུ་གནས། །
en: Will remain for sixty-three thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །བསོད་ནམས་འབྲས་བུ་གསེར་གྱིས་རྣམ་པར་སྤྲས། །
en: The relics of this victor will be abundant, And things resulting from merit will be decorated with gold.

source: འཇིག་རྟེན་མགོན་པོ་ཁ་ལོ་སྒྱུར་བ་ཡི། །སྐྱེ་ཡུལ་མཆོད་རྟེན་ཁ་ལོ་སྒྱུར་ཞེས་བྱ། །
en: “The protector of the world, Sārathi, Will be born in a place called Leader Stūpa.

source: རྒྱལ་བའི་རིགས་ནི་བྲམ་ཟེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་དགུ་ཡོད་ཡབ་ནི་ང་རོ་མཆོག །རབ་མཆོག་ཅེས་ནི་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: The family of this victor will be brahmin, And his light will extend nine leagues. “Supreme Roar will be his father, and Most Supreme will be this victor’s mother.

source: སྲས་པོ་མཆོག་སྦྱིན་པད་མ་རིམ་གྲོ་པ། །
en: Supreme Gift will be his son and Lotus his attendant.

source: མན་དཱ་ར་བའི་བསུང་ལྡན་བློ་ཅན་ཏེ། །
en: Mandārava Fragrance will be the one of intelligence

source: ལེགས་པར་མཆོད་པའི་བསུང་ལྡན་རྫུ་འཕྲུལ་ཅན། །
en: And Fragrance of Excellent Worship the one of miracles.

source: འདུས་པ་ལན་གྲངས་བཅུ་དྲུག་ཀུན་ལ་ཡང་། །དགྲ་བཅོམ་ང་མེད་ཐ་བ་སྤངས་པ་པོ། །བྱེ་ཕྲག་བདུན་ཅུ་དྲུག་དྲུག་འདུས་པར་འགྱུར། །
en: “There will be sixteen consecutive congregations, Each of them gathering seven hundred sixty million Selfless worthy ones who have abandoned rigidity.

source: ཞི་བར་ཕྱིན་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་དགུ་ཁྲིའི་བར་དུ་གནས་པར་འགྱུར། །
en: “And the sacred Dharma of the one gone to peace Will remain for ninety thousand years.

source: སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་མཆོད་རྟེན་གྲངས། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་རྩ་དགུ་འབྱུང་། །
en: His relics will be abundant, And the stūpas will number nine hundred ninety million.

source: དེ་བཞིན་གཤེགས་པ་སྐྱེ་དབང་མཚུངས་པ་ཡི། །སྐྱེ་ཡུལ་དབང་པོའི་རྒྱལ་མཚན་ཞེས་ཀྱང་བྱ། །
en: “The thus-gone Janendrakalpa Will be born in a place called Royal Banner.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་རྩ་གཉིས་རྒྱལ་བའི་དབང་པོ་ཡབ། །དབང་མཆོག་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be brahmin, And his light will extend twenty-two leagues. “Victorious Lord will be his father, and Supreme Lady will be this victor’s mother.

source: སྲས་པོ་དབང་ལྡན་ལེགས་དབང་རིམ་གྲོ་པ། །
en: Powerful will be his son and Excellent Power his attendant.

source: དབང་ཆེན་སྒྲོན་མ་བློ་གྲོས་ཅན་ཡིན་ཏེ
en: Lamp of Great Power will be the one of intelligence

source: འཇིགས་མེད་དབང་པོ་ཞེས་བྱ་རྫུ་འཕྲུལ་ཅན། །
en: And Fearless Lord the one of miracles.

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་དྲུག་ཀུན་ལའང་། །ཐ་སྤངས་ཉོན་མོངས་སྦྱངས་པའི་ཡིད་ལྡན་པ། །བདུད་ལས་རྣམ་གྲོལ་ཐེར་འབུམ་ཐེར་འབུམ་ཡོད། །
en: “There will be sixty-six consecutive congregations, Each of them gathering one billion Whose minds have relinquished rigidity and purified defilement, and who are free from the māras.

source: མི་ཚེ་ལོ་གྲངས་བདུན་ཁྲི་ཚང་བ་ཡིན། །
en: The lifespan of humans will be seventy thousand years,

source: འགྲོ་ལ་ཕན་ཕྱིར་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་སྟོང་ཚང་བའི་བར་དུ་གནས་པར་འགྱུར། །
en: “And for the benefit of wandering beings The sacred Dharma will remain for a thousand years.

source: རྒྱལ་བ་མྱ་ངན་འདས་པའི་སྐུ་གདུང་གི། །མཆོད་རྟེན་དཔག་ཚད་ལྔ་པ་གཅིག་ཀྱང་འབྱུང་། །
en: When this victor has attained nirvāṇa There will be a single stūpa, five leagues large, for his relics.

source: སངས་རྒྱས་མེ་ཏོག་ཏོག་ནི་སྐྱེ་བའི་ཡུལ། །མེ་ཏོག་དག་ལ་དགའ་བའི་རང་བཞིན་ཡིན། །
en: “The buddha Puṣpaketu Will be born in a place called Delighting in Flowers.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་རྩ་དྲུག་མེ་ཏོག་བཟང་པོ་ཡབ། །རྒྱལ་ཡུམ་མེ་ཏོག་ཅན་ཡིན་མེ་ཏོག་རྒྱས། །སྲས་ཡིན་མེ་ཏོག་བཟང་པོ་རིམ་གྲོ་པ། །
en: His family will be kṣatriya, And his light will extend twenty-six leagues. “Excellent Flower will be his father, and Endowed with Flowers will be this victor’s mother. Blooming Flower will be his son and Excellent Flower his attendant.

source: མེ་ཏོག་ཆེན་པོའི་གཟི་བརྗིད་བློ་ཅན་ཏེ། །
en: Splendid Great Flower will be the one of intelligence

source: མེ་ཏོག་སྒྲོན་མ་ཞེས་བྱ་རྫུ་འཕྲུལ་ཅན། །
en: And Flower Lamp the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །ཐ་སྤངས་དུག་རྩ་བཅད་པར་མཚུངས་པ་པོ། །བྱེ་བ་ཕྲག་ནི་བདུན་ཅུ་གཉིས་གཉིས་ཡོད། །
en: “There will be eighty consecutive congregations, Each of them gathering seven hundred twenty million Who have all equally given up rigidity and severed the poisonous roots.

source: འགོག་པར་ཕྱིན་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་དགུ་ཁྲི་དགུ་སྟོང་བར་དུ་གནས། །
en: “And when this teacher has gone to cessation His sacred Dharma will also remain for ninety-nine thousand years.

source: དཔག་ཚད་གཅིག་པའི་མཆོད་རྟེན་འབྱུང་འགྱུར་ཏེ། །གསེར་གྱི་དྲ་བ་རྒྱལ་མཚན་དག་གིས་སྤྲས། །
en: There will be a single stūpa, measuring one league, Which will be decorated with nets of gold and parasols.

source: འཇིག་རྟེན་མགོན་པོ་སྒྲ་གཅན་འཛིན་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་རིན་ཆེན་འོད་ཅེས་བྱ། །
en: “The protector of the world, Rāhula, Will be born in a place called Jewel Light.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །སུམ་ཅུ་རྩ་གཅིག་ཚུལ་ཁྲིམས་བཟང་པོ་ཡབ། །ཚུལ་ཁྲིམས་ཅན་ཡིན་རྒྱལ་ཡུམ་སྲས་པོ་ནི། །ཚུལ་ཁྲིམས་བཟང་པོ་མཆོད་ལེགས་རིམ་གྲོ་པ། །
en: His family will be kṣatriya, And his light will extend thirty-one leagues. “Excellent Discipline will be his father, and Endowed with Discipline will be this victor’s mother. Excellent Discipline will be his son and Excellent Worship his attendant.

source: སྲིད་པ་གཅོད་བྱེད་བློ་གྲོས་ཅན་ཡིན་ཏེ
en: Cutting through Existence will be the one of intelligence

source: འགྲོས་བརྟན་ཞེས་ནི་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Stable Mode the one of miracles.

source: འདུས་པ་ལན་གྲངས་ཉི་ཤུ་ཀུན་ལ་ཡང་། །དྲང་སྲོང་ཐམས་ཅད་ཚང་བར་འདུས་འགྱུར་ཏེ། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་རེ་རེ་ཡོད། །
en: “There will be twenty consecutive congregations, Each of them gathering a complete group Of two hundred million sages.

source: རྒྱལ་བའི་དམ་ཆོས་ལོ་གྲངས་བྱེ་བ་ཕྲག །བདུན་ཁྲི་སུམ་སྟོང་བར་དུ་གནས་པར་འགྱུར། །
en: “And the sacred Dharma of this victor Will remain for seven hundred thirty billion years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །འགྲོ་བ་ཀུན་གྱིས་བགྲང་བར་ནུས་མ་ཡིན། །
en: The relics of this victor will be abundant, Impossible to count by any wandering being.

source: དེ་བཞིན་གཤེགས་པ་རྩི་སྨན་ཆེན་པོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་སྨན་དང་ལྡན་ཞེས་བྱ། །
en: “The thus-gone Mahauṣadhi Will be born in a place called Endowed with Medicine.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་རྩ་གཉིས་ཡབ་ནི་མཛོད་བཟངས་ཡིན། །མདངས་དགའ་རྒྱལ་བའི་ཡུམ་ཡིན་སྲས་པོ་ནི། །ཐར་འདོད་ཤིན་ཏུ་ཐར་པ་རིམ་གྲོ་པ། །
en: His family will be brahmin, And his light will extend twenty-two leagues. “Excellent Treasury will be his father, and Bright Joy will be this victor’s mother. Wish for Liberation will be his son and Complete Liberation his attendant.

source: ཡོན་ཏན་ངེས་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Certain Qualities will be the scholar

source: ཆོས་ལ་གནས་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Abiding within Dharma the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །དགྲ་བཅོམ་དེ་དག་ཐམས་ཅད་འདུས་འགྱུར་ཏེ། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་བཞི་བཞི་ཡོད། །
en: “There will be eighty consecutive congregations, Each of them gathering a full group Of two hundred forty million worthy ones.

source: མི་ཚེ་ལོ་གྲངས་ཉི་ཁྲི་ཚང་བར་འགྱུར། །
en: The lifespan of humans will be twenty thousand years,

source: འགོག་པར་ཕྱིན་པ་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་ཉི་ཁྲི་དྲུག་སྟོང་བར་དུ་གནས། །
en: “And when this teacher has gone to cessation His sacred Dharma will remain for twenty-six thousand years.

source: སེམས་ཅན་མཁས་པ་མྱ་ངན་འདས་ནས་ཀྱང་། །སྐུ་གདུང་མཆོད་རྟེན་དཔག་ཚད་གཉིས་པ་གཅིག །
en: When this expert on sentient beings has attained nirvāṇa There will be a single stūpa for his relics that will measure two leagues.

source: རྡུལ་དང་བྲལ་བ་རྒྱུ་སྐར་རྒྱལ་པོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་ཟླ་བའི་འོད་ཅེས་བྱ། །
en: “The immaculate Nakṣatrarāja Will be born in a place called Moonlight.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །བདུན་ཅུ་རྩ་གཉིས་ཡབ་ནི་ཟླ་བཟང་ཡིན། །ཟླ་མཆོག་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be brahmin, And his light will extend seventy-two leagues. “Excellent Moon will be his father, and Supreme Moon will be this victor’s mother.

source: སྲས་པོ་ཟླས་བྱིན་ཟླ་ལེགས་རིམ་གྲོ་པ། །
en: Moon Gift will be his son and Good Moon his attendant.

source: འོད་ཟེར་ཆེན་པོ་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: Great Radiance will be the scholar

source: གཟི་བརྗིད་འོད་ཅེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Splendid Light the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །དགྲ་བཅོམ་བྱེ་ཕྲག་བདུན་ཅུ་གཉིས་གཉིས་དང་། །གཞན་ཡང་བྱེ་བ་ཕྲག་ནི་བརྒྱ་བརྒྱ་ཡོད། །
en: “There will be eighty consecutive congregations, Each of them gathering seven hundred twenty million worthy ones, And then again one billion.

source: མཚུངས་པ་མེད་པ་མྱ་ངན་འདས་པ་ཡི། །དམ་ཆོས་ལོ་གྲངས་དགུ་བཅུ་དྲུག་ཏུ་གནས། །
en: “And when this incomparable one has attained nirvāṇa His sacred Dharma will remain for ninety-six years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །སྲིད་པ་གསུམ་ན་མཆོད་ཅིང་བཀུར་བར་འགྱུར། །
en: The relics of this victor will be abundant As well as worshiped and venerated throughout the three realms.

source: དེ་བཞིན་གཤེགས་པ་སྨན་པའི་རྒྱལ་པོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་ཀུན་ནས་གནས་ཞེས་བྱ། །
en: “The thus-gone Vaidyarāja Will be born in a place called Universal Abiding.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་རྩ་བཞི་ཡུལ་འཁོར་བཟང་པོ་ཡབ། །མདངས་ལྡན་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be brahmin, And his light will extend twenty-four leagues. “Land of Excellence will be his father, and Possessor of Brightness will be this victor’s mother.

source: སྲས་པོ་ལྷ་ལེགས་འགྲོས་ལྡན་རིམ་གྲོ་པ། །
en: Divine Excellence will be his son and Endowed with the Mode his attendant.

source: དགའ་ལྡན་ཞེས་ནི་བྱ་བ་མཁས་པ་སྟེ། །
en: Joyous will be the scholar

source: མི་ཟད་བློ་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Inexhaustible Intellect the one of miracles.

source: དགྲ་བཅོམ་ཐམས་ཅད་དག་ཀྱང་འདུས་འགྱུར་ཏེ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་གཉིས་སྙེད་འབྱུང་། །
en: “When all the worthy ones gather There will be nine hundred twenty million.

source: དེ་ན་མི་རྣམས་དག་གི་ཚེ་ཡི་ཚད། །ལོ་གྲངས་བདུན་ཁྲི་དག་ཏུ་ཚང་བར་འགྱུར། །
en: At that time the lifespan of humans Will be seventy thousand years,

source: རྣམ་པར་གྲོལ་བར་ཕྱིན་པའི་དམ་ཆོས་དག །ལོ་གྲངས་སྟོང་ཕྲག་བཅྭ་བརྒྱད་བར་དུ་གནས། །
en: “And the sacred Dharma of the one who has entered liberation Will remain for eighteen thousand years.

source: མིག་སྦྱིན་པ་ནི་མྱ་ངན་འདས་ནས་ཀྱང་། །སྐུ་གདུང་མཆོད་རྟེན་དཔག་ཚད་གསུམ་པ་གཅིག །
en: When this giver of sight has attained nirvāṇa His relics will be contained in a stūpa measuring three leagues.

source: དེ་བཞིན་གཤེགས་པ་བསོད་ནམས་གླང་པོ་ཡི། །སྐྱེ་ཡུལ་གླང་པོ་རིན་པོ་ཆེ་ཞེས་བྱ། །
en: “The thus-gone Puṇyahastin Will be born in a place called Precious Elephant.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །སུམ་ཅུ་རྩ་བཞི་བདག་ཉིད་ཆེན་པོ་ཡབ། །རིན་ཆེན་ལྡན་མ་རྒྱལ་ཡུམ་ང་རྒྱལ་ཅན། །སྲས་ཡིན་བློ་གྲོས་ཅན་ནི་རིམ་གྲོ་པ། །
en: His family will be kṣatriya, And his light will extend thirty-four leagues. “Great Being will be his father, and Possessor of Jewels will be this victor’s mother. Proud will be his son and Intelligent his attendant.

source: རིན་ཆེན་ཚོགས་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Gathering of Jewels will be the scholar

source: ནོར་ཀུན་མཐོང་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Seeing All Wealth the one of miracles.

source: འདུས་པ་ལན་གྲངས་ལྔ་སྟེ་ཀུན་ལ་ཡང་། །བྱེ་བ་སྟོང་ཕྲག་ཉི་ཤུ་གཉིས་གཉིས་ཡོད། །
en: “There will be five consecutive congregations, Each of them gathering two hundred twenty million.

source: སྐུ་ཚེའི་ཚད་དག་ལོ་གྲངས་སྟོང་ཕྲག་ནི། །བཅྭ་ལྔ་རངས་པར་ཚང་བར་འགྱུར་བ་ཡིན། །
en: His lifespan will reach A full fifteen thousand years,

source: ཁྱུ་མཆོག་ཆེན་པོའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་བདུན་ཁྲི་ཉིས་སྟོང་བར་དུ་གནས། །
en: “And the sacred Dharma of this majestic leader Will remain for seventy-two thousand years.

source: མཚུངས་པ་མེད་པ་མྱ་ངན་འདས་ནས་ཀྱང་། །སྐུ་གདུང་མཆོད་རྟེན་དཔག་ཚད་གཅིག་པ་འབྱུང་། །
en: When this incomparable one has attained nirvāṇa His relics will be contained in a stūpa measuring one league.

source: དེ་བཞིན་གཤེགས་པ་མཆོད་པར་མཛད་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་གསལ་བར་མཐོང་ཞེས་བྱ། །
en: “The thus-gone Chedana Will be born in a place called Seen Clearly.

source: དེའི་རིགས་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བདུན་ཅུ་ཡབ་ནི་ས་ག་ཡིན། །རི་དགས་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be kṣatriya, And his light will extend seventy leagues. “Saga will be his father, and Deer Lady will be this victor’s mother.

source: སྲས་པོ་དག་བྱེད་ལེགས་དག་རིམ་གྲོ་པ། །
en: Purifier will be his son and Well Purified his attendant.

source: དྲང་སྲོང་རྟོགས་ཞེས་བྱ་བ་མཁས་པ་སྟེ། །
en: Sage Realization will be the scholar

source: ལེགས་པར་རྟོགས་པའི་ཡེ་ཤེས་རྫུ་འཕྲུལ་ཅན། །
en: And Wisdom of Fine Realization the one of miracles.

source: འདུས་པ་ལན་གྲངས་བདུན་ཅུ་དྲུག་ཀུན་ལའང་། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་བཞི་བཞི་དང་། །གཞན་ཡང་དགྲ་བཅོམ་བྱེ་བ་སྟོང་སྟོང་ཡོད། །
en: “There will be seventy-six consecutive congregations, Each of them gathering two hundred forty million, Along with ten billion worthy ones.

source: དུས་གསུམ་མཁྱེན་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་བརྒྱད་ཁྲིའི་བར་དུ་གནས་པར་འགྱུར། །
en: “And the sacred Dharma of this knower of the three times Will remain for eighty thousand years.

source: མཚུངས་པ་མེད་པ་མྱ་ངན་འདས་ནས་ཀྱང་། །དེ་ཚེ་སྐུ་གདུང་དག་ནི་རྒྱས་པར་འགྱུར། །
en: When this incomparable one has attained nirvāṇa His relics will be abundant.

source: བདེ་གཤེགས་རྣམ་པར་གྲགས་པའི་རྒྱལ་པོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་དག་པར་གྲགས་ཞེས་བྱ། །
en: “The well-gone Vighuṣṭarāja Will be born in a place called Famed Purity.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་བརྒྱད་ཡོད་ཡབ་ནི་དད་པ་ཡིན། །བློ་གྲོས་གྲགས་ཞེས་བྱ་བ་ཡུམ་ཡིན་ནོ། །
en: The family of this victor will be kṣatriya, And his light will extend eight leagues. “Faith will be his father, and Famed Intelligence will be this victor’s mother.

source: སྲས་པོ་ལེགས་གྲགས་གྲགས་པ་རིམ་གྲོ་པ། །
en: Excellent Fame will be his son and Fame his attendant.

source: ཡོན་ཏན་གྲགས་ཞེས་བྱ་བ་བློ་ཅན་ཏེ། །
en: Famed Qualities will be the scholar

source: རྫུ་འཕྲུལ་ཤིན་ཏུ་སྦྱངས་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Highly Accomplished Miraculous Display the one of miracles.

source: འདུས་པ་ལན་གྲངས་དགུ་བཅུ་ཀུན་ལ་ཡང་། །ཕུང་པོར་འཛིན་ལ་མི་ལྟ་རྣམ་གྲོལ་བ། །བྱེ་བ་ཕྲག་ནི་བདུན་ཅུ་གཉིས་གཉིས་ཡོད། །
en: “There will be ninety consecutive congregations, Each of them gathering seven hundred twenty million Liberated ones who do not form views based on grasping the aggregates.

source: མཚུངས་པ་མེད་པའི་དམ་པའི་ཆོས་དག་ཀྱང་། །ལོ་གྲངས་བདུན་ཁྲི་བཞི་སྟོང་བར་དུ་གནས། །
en: “And the sacred Dharma of this incomparable one Will also remain for seventy-four thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །ལྷ་དང་མི་མཆོག་དག་གིས་མཆོད་པར་འགྱུར། །
en: The relics of the victor will be abundant, Receiving the worship of gods and supreme humans.

source: དེ་བཞིན་གཤེགས་པ་ཉི་མའི་འོད་ཟེར་གྱི། །སྐྱེ་བའི་ཡུལ་ནི་ཏོག་གི་འོད་ཅེས་བྱ། །
en: “The thus-gone Sūryaraśmi Will be born in a place called Radiant Crest.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །དགུ་བཅུ་རྩ་དགུ་ཡབ་ནི་ལྷ་བཟང་ཡིན། །གསེར་འོད་མ་ནི་ཡུམ་ཡིན་སྲས་པོ་ནི། །འོད་ཟེར་བྱིན་ཡིན་ལག་བཟངས་རིམ་གྲོ་པ། །
en: His family will be brahmin, And his light will extend ninety-nine leagues. “Divine Excellence will be his father, and Golden Light will be this victor’s mother. Light Gift will be his son and Excellent Hand his attendant.

source: འོད་དང་ལྡན་པ་བློ་གྲོས་ཅན་ཡིན་ཏེ། །
en: Endowed with Light will be one intelligence

source: སྒྲོན་མ་འོད་ཅེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Lamp Light the one of miracles.

source: འདུས་པ་ལན་གྲངས་དྲུག་ཅུ་དྲུག་ཀུན་ལའང་། །དགྲ་བཅོམ་ཆགས་པ་མེད་པར་གྱུར་པ་པོ། །བྱེ་བ་ཕྲག་ནི་སྟོང་སྟོང་འདུས་པར་འགྱུར། །
en: “There will be sixty-six consecutive congregations, Each of them gathering ten billion Worthy ones without attachment.

source: མི་ཚེ་ལོ་གྲངས་སྟོང་ཕྲག་བཅུ་གཉིས་ཡིན། །
en: The lifespan of humans will be twelve thousand years,

source: འཇིག་རྟེན་མཁྱེན་པ་མྱ་ངན་འདས་པ་ཡི། །དམ་ཆོས་ལོ་གྲངས་སྟོང་དུ་གནས་པར་འགྱུར། །
en: “And when this knower of the world has attained nirvāṇa, His sacred Dharma will remain for one thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་དཔག་ཚད་ནི། །སུམ་ཅུ་པ་གཅིག་གསེར་གྱིས་སྤྲ་བར་བྱས། །
en: The relics of the victor will be contained in a stūpa Thirty leagues large and adorned with gold.

source: དེ་བཞིན་གཤེགས་པ་ཆོས་ཀྱི་མཛོད་དག་གི། །སྐྱེ་བའི་ཡུལ་ནི་ཡེ་ཤེས་འོད་ཅེས་བྱ། །
en: “The thus-gone Dharmakośa Will be born in a place called Light of Wisdom.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་རྩ་གཉིས་ཡབ་ནི་ལེགས་སྤོང་ཡིན། །མཛོད་མཆོག་མ་ཞེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be brahmin, And his light will extend twenty-two leagues. “Excellent Abandonment will be his father, and Supreme Treasury will be this victor’s mother.

source: སྲས་པོ་རྒྱལ་སྲས་དྲང་སྲོང་རིམ་གྲོ་པ། །
en: Prince will be his son and Sage his attendant.

source: དྲང་སྲོང་མཐུ་རྩལ་ཅན་ནི་མཁས་པ་སྟེ། །
en: Powerful Sage will be the scholar

source: འཇིགས་པ་མེད་པའི་ཡེ་ཤེས་རྫུ་འཕྲུལ་ཅན། །
en: And Fearless Wisdom the one of miracles.

source: འདུས་པ་ལན་གྲངས་བཅུ་དྲུག་ཀུན་ལ་ཡང་། །ལུས་སྦྱངས་ཆགས་པ་མེད་པར་གྱུར་པ་པོ། །དགྲ་བཅོམ་ཐེར་འབུམ་ཐེར་འབུམ་ཚང་བར་ཡོད། །
en: “There will be sixteen consecutive congregations, Each of them gathering one billion Worthy ones who have purified the body and are free from attachment.

source: མྱ་ངན་འདས་པ་དེ་ཡི་དམ་ཆོས་དག །ལོ་གྲངས་བདུན་ཁྲིའི་བར་དུ་གནས་པར་འགྱུར། །
en: “And when this teacher has attained nirvāṇa His sacred Dharma will remain for seventy thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་མཆོད་རྟེན་གཅིག་ཡིན་ཏེ། །དཔག་ཚད་ལྔ་པ་ཀུན་ནས་མཛེས་པར་བྱས། །
en: The single relic of this victor will be contained in a stūpa Five leagues large and beautifully decorated.

source: འཇིག་རྟེན་མགོན་པོ་བློ་གྲོས་བཟང་པོ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་བློ་གྲོས་བཀོད་ཅེས་བྱ། །
en: “The protector of the world Sumati Will be born in a place called Array of Intelligence.

source: རྒྱལ་བའི་རིགས་ནི་རྒྱལ་རིགས་འོད་ཀྱི་ཚད། །དཔག་ཚད་གསུམ་ཡོད་ཡབ་ནི་བློ་གྲོས་ཅན། །བློ་གྲོས་ཆེན་མོ་རྒྱལ་ཡུམ་ཀུན་གྱིས་བཀུར། །སྲས་ཡིན་བློ་གྲོས་དབང་པོ་རིམ་གྲོ་པ། །
en: The family of this victor will be kṣatriya, And his light will extend three leagues. “Intelligent will be his father, and Great Intelligence will be this victor’s mother. Venerated by All will be his son and Lord of Intelligence his attendant.

source: ཡོན་ཏན་མཆོད་རྟེན་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: Stūpa of Qualities will be the scholar

source: ཕྱོགས་གསལ་བ་ཞེས་བྱ་བ་རྫུ་འཕྲུལ་ཅན། །
en: And Clear Position the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་ཅུ་ཀུན་ལ་ཡང་། །ཆགས་མེད་རིམས་ནད་མེད་པའི་བསམ་གཏན་པ། །བྱེ་བ་ཕྲག་ནི་ཉི་ཤུ་གཉིས་གཉིས་ཡོད། །
en: “There will be eighty consecutive congregations, Each of them gathering two hundred twenty million Unattached meditators who are free from the plagues.

source: མི་ཚེ་ལོ་གྲངས་སུམ་ཁྲི་ཐམ་པ་ཡིན། །
en: The lifespan of humans will be thirty thousand years,

source: རྒྱལ་བ་འཁྲུགས་པ་མེད་པར་ཕྱིན་པ་ཡི། །དམ་ཆོས་ལོ་གྲངས་སུམ་ཁྲིར་གནས་པར་འགྱུར། །
en: “And when this victor has gone to the immutable His sacred Dharma will also remain for thirty thousand years.

source: རྒྱལ་བའི་སྐུ་གདུང་དག་ནི་རྒྱས་འགྱུར་ལ། །མཆོད་རྟེན་གྲངས་ནི་ཐེར་འབུམ་བཅུ་དྲུག་འབྱུང་། །
en: The relics of this victor will be abundant, And there will appear sixteen billion stūpas.

source: མགོན་པོ་ཡོན་ཏན་དབང་མཚུངས་སྐྱེ་བ་ཡི། །ཡུལ་ནི་ཏོག་གི་དབང་པོའི་རྒྱལ་མཚན་ཡིན། །
en: “The protector Guṇendrakalpa Will be born in a place called Banner of the Highest Lord.

source: རིགས་ནི་བྲམ་ཟེ་ཡིན་ཏེ་འོད་ཀྱི་ཚད། །དཔག་ཚད་བཅྭ་བརྒྱད་ཡབ་ནི་དབང་པོ་ཡིན། །ཡོན་ཏན་དབང་པོ་བློ་གྲོས་རྒྱལ་བའི་ཡུམ། །
en: His family will be brahmin, And his light will extend eighteen leagues. “Lord will be his father, and Intelligence of the Lord of Qualities will be this victor’s mother.

source: སྲས་པོ་དབང་ལྡན་ཚོགས་དབང་རིམ་གྲོ་པ། །
en: Endowed with Mastery will be his son and Lord of the Gathering his attendant.

source: ཡོན་ཏན་ཚོགས་ཞེས་བྱ་བ་བློ་ཅན་ཏེ། །
en: Gathering of Qualities will be the one of intelligence

source: ཡོན་ཏན་ཀུན་གྱི་ཚོགས་ནི་རྫུ་འཕྲུལ་ཅན། །
en: And Gathering of All Qualities the one of miracles.

source: འདུས་པ་ལན་གྲངས་བརྒྱད་དེ་ཀུན་ལ་ཡང་། །རྒྱལ་སྲས་ལུས་ནི་ལེགས་པར་སྦྱངས་པ་པོ། །དགྲ་བཅོམ་ཆགས་པ་མེད་པ་ཤ་སྟག་གོ། །
en: “There will be eight consecutive congregations, All of them gathering exclusively victor-offspring who have purified the body, Worthy ones free from attachment.

source: མཚུངས་པ་མེད་པ་མྱ་ངན་འདས་པ་ཡི། །དམ་ཆོས་ལོ་གྲངས་བརྒྱད་ཅུའི་བར་དུ་གནས། །
en: “And when this incomparable one has attained nirvāṇa His sacred Dharma will remain for eighty years.

source: སྐུ་གདུང་མཆོད་རྟེན་ཆེན་པོ་གཅིག་ཡིན་ཏེ། །རིན་ཆེན་དྲ་བ་རྒྱལ་མཚན་དག་གིས་སྤྲས། །
en: The single relic of this victor will be contained in a stūpa Draped with jewel nets and studded with banners.

source: དེ་བཞིན་གཤེགས་པ་རྡོ་རྗེའི་སྡེ་སྐྱེ་བའི། །ཡུལ་ནི་རིན་པོ་ཆེ་དང་ལྡན་ཞེས་བྱ། །
en: “The thus-gone Vajrasena Will be born in a place called Endowed with Jewels.

source: དཔག་ཚད་གསུམ་ཡོད་ཡབ་ནི་སྡེ་བཟངས་ཡིན། །ངེས་བརྟན་རྒྱལ་བའི་ཡུམ་ཡིན་སྲས་པོ་ནི། །རྡོ་རྗེ་བྱིན་ཡིན་གསལ་བ་རིམ་གྲོ་པ། །
en: And his light will extend three leagues. “Excellent Force will be his father, and Truly Stable will be this victor’s mother. Vajra Gift will be his son and Luminous his attendant.

source: ཕས་རྒོལ་དྲི་མ་མེད་པའི་བློ་ཅན་ཏེ། །
en: Unstained by Attacks will be the one of intelligence

source: སྨན་གྱི་རྒྱལ་པོ་ཞེས་བྱ་རྫུ་འཕྲུལ་ཅན། །
en: And King of Medicine the one of miracles.

source: འདུས་པ་ལན་གྲངས་ཉི་ཤུ་དྲུག་ཀུན་ལ། །མཚན་མ་མེད་པས་ཤིན་ཏུ་དུལ་དེ་ཀུན། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་གསུམ་གསུམ་ཡོད། །
en: “There will be twenty-six consecutive congregations, Each of them gathering nine hundred thirty million Who have become extremely gentle by means of the absence of marks.

source: དེ་ཡི་དམ་ཆོས་ལོ་གྲངས་སྟོང་ཕྲག་ནི། །ཉི་ཤུ་རྩ་བརྒྱད་བར་དུ་གནས་པར་འགྱུར། །
en: “And the sacred Dharma of this teacher Will also remain for twenty-eight thousand years.

source: འཇིག་རྟེན་མཁྱེན་པ་མྱ་ངན་འདས་ནས་ཀྱང་། །སྐུ་གདུང་རྒྱས་འགྱུར་ཞིང་རྣམས་གང་བར་འགྱུར། །
en: After this knower of the world has attained nirvāṇa His relics will be abundant, filling the realms.

source: དེ་བཞིན་གཤེགས་པ་ཤེས་རབ་བརྩེགས་པ་ཡི། །སྐྱེ་བའི་ཡུལ་ནི་ཤེས་རབ་བརྩེགས་ཞེས་བྱ། །
en: “The thus-gone Prajñākūṭa Will be born in a place called Summit of Insight.

source: རིགས་ནི་རྒྱལ་རིགས་ཡིན་ཏེ་འོད་དཔག་ཚད། །ཉི་ཤུ་རྩ་གཉིས་ཤེས་རབ་བཟང་པོ་ཡབ། །ཤེས་རབ་མཆོག་ཅེས་བྱ་བ་རྒྱལ་བའི་ཡུམ། །
en: His family will be kṣatriya, And his light will extend twenty-two leagues. “Excellent Insight will be his father, and Supreme Insight will be this victor’s mother.

source: སྲས་པོ་ཤེས་བྱིན་ཤེས་བཟངས་རིམ་གྲོ་པ། །
en: Insight Gift will be his son and Excellent Insight his attendant.

source: ཤེས་རབ་འབྱུང་གནས་ཞེས་བྱ་མཁས་པ་སྟེ། །
en: Source of Insight will be the scholar

source: ཤེས་རབ་རྣམ་པར་སྦྱངས་པ་རྫུ་འཕྲུལ་ཅན། །
en: And Purified Insight the one of miracles.

source: འདུས་པ་ལན་གྲངས་སུམ་ཅུ་ཀུན་ལ་ཡང་། །དགྲ་བཅོམ་ཐམས་ཅད་ཐར་པར་གཞོལ་བ་པོ། །བྱེ་བ་ཕྲག་ནི་དགུ་བཅུ་གཉིས་གཉིས་ཡོད། །
en: “There will be thirty consecutive congregations, Each of them gathering nine hundred twenty million Worthy ones who have merged with liberation.

source: ཡོངས་སུ་མྱ་ངན་འདས་པའི་དམ་ཆོས་དག །ལོ་གྲངས་སྟོང་ཕྲག་བཅྭ་ལྔར་གནས་པར་འགྱུར། །
en: “And when this teacher has attained parinirvāṇa His sacred Dharma will remain for fifteen thousand years.
